# Задача 32:
# Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону
# (т.е. не меньше заданного минимума и не больше заданного максимума)

# [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7] 5 10
# [1, 9, 13, 14, 19]


array = [int(x) for x in input("Введите значения массива: ").split()]
limits = [int(x) for x in input("Введите мин и макc диапазона: ").split()]

result = []
for i in range(len(array)):
    if limits[0] <= array[i] <= limits[1]:
        result.append(i)
print(result)
