# Задача 2:
# Найдите сумму цифр трехзначного числа.

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

n = int(input("Введите трехзначное число: "))
a = n % 10
b = n % 100 // 10
c = n // 100
print(n, " -> ", a + b + c)
